<?php

/**
 * Concord CRM - https://www.concordcrm.com
 *
 * @copyright Copyright (c) 2022-2025 KONKORD DIGITAL
 */

return [
    'add' => 'افزودن جدید',
    'fields' => 'فیلدها',
    'field' => 'فیلد',
    'updated' => 'فیلدهای به‌روز شده',
    'hide_fields' => 'مخفی کردن :count فیلد',
    'more_fields' => ':count فیلد دیگر',
    'reseted' => 'فیلدها با موفقیت به حالت اولیه بازگردانده شدند',
    'all' => 'همه فیلدها',
    'select' => 'انتخاب فیلدها',
    'updated_field' => 'فیلد به‌روز شده',
    'update_field' => 'به‌روزرسانی فیلد',
    'optional' => '(اختیاری)',
    'configured' => 'فیلدها با موفقیت پیکربندی شدند',
    'no_longer_available' => 'فیلد دیگر در دسترس نیست',
    'new_value' => 'مقدار جدید',
    'old_value' => 'مقدار قبلی',
    'manage' => 'مدیریت فیلدها',
    'hide_updated' => 'مخفی کردن فیلدهای به‌روز شده',
    'view_updated' => 'مشاهده فیلدهای به‌روز شده',
    'primary' => 'فیلد اصلی',
    'visible' => 'قابل مشاهده',
    'label' => 'برچسب',
    'is_readonly' => 'فقط خواندنی',

    'keep_existing_value' => 'نگه داشتن مقدار فعلی',
    'replace_existing_value' => 'جایگزینی مقدار فعلی با...',

    'settings' => [
        'create' => 'فیلدهای ایجاد',
        'create_info' => 'فیلدهایی که هنگام ایجاد سابقه توسط کاربر نمایش داده می‌شوند.',

        'update' => 'فیلدهای ویرایش',
        'update_info' => 'فیلدهای موجود که در نمای ویرایش/پیش‌نمایش سابقه نمایش داده می‌شوند.',

        'detail' => 'فیلدهای جزئیات',
        'detail_info' => 'فیلدهای موجود که در جزئیات سوابق نمایش داده می‌شوند.',

        'list' => 'فیلدهای لیست',
        'list_info' => 'برای تنظیم فیلدهای نمایش داده‌شده در نمای لیست، هنگام مشاهده لیست :resourceName روی آیکون :icon در نوار ناوبری کلیک کنید و «تنظیمات لیست» را انتخاب کنید.',
    ],

    'collapsed_by_default' => 'به‌طور پیش‌فرض جمع شده؟',
    'is_required' => 'الزامی؟',
    'option_enabled_will_propagate' => 'با فعال شدن، به نما «:view_name» هم اعمال می‌شود.',
    'option_disabled_will_propagate' => 'با غیرفعال شدن، به نما «:view_name» هم اعمال می‌شود.',
    'options' => 'گزینه‌ها',
    'field_is_unique' => 'یکتا',
    'mark_as_unique' => 'عدم اجازه مقادیر تکراری',
    'mark_as_unique_change_info' => 'مقدار این گزینه فقط هنگام ایجاد فیلد قابل تنظیم است.',
    'unmark_as_unique_change_info' => 'این اقدام غیرقابل بازگشت است؛ پس از حذف وضعیت یکتا، امکان تنظیم مجدد یکتا وجود ندارد.',

    'validation' => [
        'exist' => 'به نظر می‌رسد فیلدی با این شناسه از قبل برای این منبع وجود دارد.',
        'requires_options' => 'برای این فیلد گزینه اضافه کنید.',
        'field_type_invalid' => 'نوع فیلد پشتیبانی نمی‌شود',
        'field_id_invalid' => 'فقط حروف کوچک (a-z) و زیرخط (_) پذیرفته می‌شود.',
        'refuses_options' => 'این فیلد از گزینه پشتیبانی نمی‌کند.',
        'option_coma' => 'استفاده از کاما در نام گزینه‌ها مجاز نیست.',
    ],

    'custom' => [
        'create_option_icon' => 'برای ایجاد گزینه جدید روی آیکون :icon کلیک کنید.',
        'or_add_options_via_text' => 'یا گزینه‌ها را به صورت متن اضافه کنید',
        'convert_text_to_options' => 'تبدیل متن به گزینه',
        'text_options_each_on_new_line' => 'هر گزینه را در یک خط جدید وارد یا paste کنید.',
        'field' => 'فیلد سفارشی',
        'create' => 'ایجاد فیلد سفارشی جدید',
        'update' => 'به‌روزرسانی فیلد سفارشی',
        'type' => 'نوع فیلد',
        'id' => 'شناسه فیلد',
        'id_info' => 'شناسه فیلد را با حروف کوچک وارد کنید؛ فقط حروف (a-z) و زیرخط (_) پذیرفته می‌شود.',

        'updated' => 'فیلد سفارشی با موفقیت به‌روزرسانی شد',
        'created' => 'فیلد سفارشی با موفقیت ایجاد شد',
        'deleted' => 'فیلد سفارشی با موفقیت حذف شد',
    ],

    'email_copied' => 'آدرس ایمیل در کلیپبورد کپی شد',
];
